app/views/blogs/_blog.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
 <%@user = User.find_by(id: blog.user)%>