app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "comment", "tag", "created_at", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "test2"], ["body", "test2"], ["comment", nil], ["tag", nil], ["created_at", "2022-04-14 18:40:20.410711"], ["updated_at", "2022-04-14 18:40:20.410711"], ["user", "1"]]

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "title" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "test2222"], ["updated_at", "2022-04-14 19:29:12.795057"], ["id", 1]]