app/controllers/Blogs_Controller.rb

    def create
        @blog = Blog.new(user:session[:user_id],body:blog_params[:body],title:blog_params[:title])
        # @comment = @blog.comments.build

        respond_to do |format|
          if @blog.save
---
INSERT INTO "blogs" ("title", "body", "comment", "tag", "created_at", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "test2"], ["body", "test2"], ["comment", nil], ["tag", nil], ["created_at", "2022-04-14 18:40:20.410711"], ["updated_at", "2022-04-14 18:40:20.410711"], ["user", "1"]]

    def edit
        @blog = Blog.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @blog = Blog.find(params[:id])

        respond_to do |format|
          if @blog.update(blog_params)
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "test2222"], ["updated_at", "2022-04-14 19:29:12.795057"], ["id", 1]]

    def destroy
        @blog = Blog.find(params[:id])
        @blog.destroy
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 4]]