app/controllers/Users_Controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "password_digest", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "sameh"], ["password_digest", "[FILTERED]"], ["email", "sameh@gmail.com"], ["created_at", "2022-04-13 19:57:56.602330"], ["updated_at", "2022-04-13 19:57:56.602330"]]